TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g120x.h
/* IOMUX_PINCM32[PF] Bits */
#define IOMUX_PINCM32_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM32_PF_GPIOB_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM32_PF_UC0_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_UC0_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_UC4_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_UC4_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)

/* IOMUX_PINCM33[PF] Bits */
#define IOMUX_PINCM33_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM33_PF_GPIOB_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM33_PF_UC0_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_UC0_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_UC4_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_UC4_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)

/* IOMUX_PINCM34[PF] Bits */
#define IOMUX_PINCM34_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM34_PF_GPIOA_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM34_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM34_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM34_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)
#define IOMUX_PINCM34_PF_TIMG0_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM34_PF_UC2_CS1                      ((uint32_t)0X00000009)
#define IOMUX_PINCM34_PF_UC0_CTS                      ((uint32_t)0X0000000A)

/* IOMUX_PINCM35[PF] Bits */
#define IOMUX_PINCM35_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM35_PF_GPIOA_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM35_PF_UC2_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM35_PF_UC9_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM35_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM35_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000006)
#define IOMUX_PINCM35_PF_TIMG0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM35_PF_UC4_CS0                      ((uint32_t)0X00000008)
#define IOMUX_PINCM35_PF_UC4_CTS                      ((uint32_t)0X00000008)
#define IOMUX_PINCM35_PF_UC2_CS3                      ((uint32_t)0X00000009)
#define IOMUX_PINCM35_PF_UC0_SDA                      ((uint32_t)0X0000000A)
#define IOMUX_PINCM35_PF_UC0_TX                       ((uint32_t)0X0000000A)

/* IOMUX_PINCM36[PF] Bits */
#define IOMUX_PINCM36_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM36_PF_GPIOA_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM36_PF_UC4_CS0                      ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_UC4_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_UC2_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_UC9_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM36_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM36_PF_UC2_CS2                      ((uint32_t)0X00000009)
#define IOMUX_PINCM36_PF_UC0_SCL                      ((uint32_t)0X0000000A)
#define IOMUX_PINCM36_PF_UC0_RX                       ((uint32_t)0X0000000A)

/* IOMUX_PINCM37[PF] Bits */
#define IOMUX_PINCM37_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM37_PF_GPIOA_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM37_PF_UC4_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_UC4_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_UC5_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_UC5_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM37_PF_TIMG8_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM37_PF_TIMA1_CCP0_CMPL              ((uint32_t)0X00000009)
#define IOMUX_PINCM37_PF_UC0_RTS                      ((uint32_t)0X0000000A)
#define IOMUX_PINCM37_PF_TIMA1_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM38[PF] Bits */
#define IOMUX_PINCM38_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM38_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM38_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UC5_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_UC5_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM38_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000007)
#define IOMUX_PINCM38_PF_UC0_CTS                      ((uint32_t)0X0000000A)
#define IOMUX_PINCM38_PF_TIMA1_CCP1                   ((uint32_t)0X0000000B)
#define IOMUX_PINCM38_PF_TIMA1_CCP1_CMPL              ((uint32_t)0X0000000C)

/* IOMUX_PINCM39[PF] Bits */
#define IOMUX_PINCM39_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM39_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM39_PF_UC5_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_UC5_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_UC4_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_UC4_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_UC5_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_UC5_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM39_PF_TIMG8_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM39_PF_UC2_CS1                      ((uint32_t)0X00000009)
#define IOMUX_PINCM39_PF_TIMA1_CCP0                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM40[PF] Bits */
#define IOMUX_PINCM40_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM40_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM40_PF_UC5_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_UC5_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_UC4_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_UC4_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_UC5_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_UC5_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_TIMG8_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM40_PF_UC2_CS0                      ((uint32_t)0X00000009)
#define IOMUX_PINCM40_PF_TIMA1_CCP1                   ((uint32_t)0X0000000A)

/* IOMUX_PINCM41[PF] Bits */
#define IOMUX_PINCM41_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM41_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM41_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_UC5_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM41_PF_UC5_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM41_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM41_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)

